app/Controllers/Home.php

    public function getUsers()  {
        $userModel=new \App\Models\UserModel();
        // Usa el modelo para crear una variable que se pueda usar
        $users= $userModel->findAll(); //Obtiene todos los registros
---
SELECT *
FROM `users`