app/Controllers/UserController.php

    public function index() {
        $userModel=new UserModel();
        $name=$this->request->getVar('name');//Búsqueda desde formulario
        // Aplicar filtro (query) con un nombre introducido
        if($name){
            $query=$userModel->like('name',$name);
        }else{
            $query=$userModel->like("name");
        }
        // $perPage=10;
        $perPage=3; //NUEVO NUMERO DE PAGINA: 3 elementos/pagina
        // $data['users']=$userModel->findAll(); //Obtener todos los usuarios
        $data['users']=$query->paginate($perPage);
---
SELECT *
FROM `users`